Tekla Open API Reference for Tekla Structures 2025
PluginPickerInput Methods
The PluginPickerInput type exposes the following members.
Methods
Name | Description
Add
 Appends a picker input to the plug-in input.
AddRange
 Appends several picker inputs to the picker input sequence.
Top
See Also
Reference
PluginPickerInput Class
Tekla.Structures.Drawing Namespace